* How to setup config/config.yml

- Uses the =yaml= format.
- Requires =gmail=
  - If your email is =kkweon@gmail.com=, then your username is =kkweon=

#+BEGIN_SRC bash :exports results :results output
cat config/config_example.yml
#+END_SRC

#+RESULTS:
: username: "kkweon"
: password: "password"
: recipients:
:   - email: "kkweon@gmail.com"
:     name: "Mo"
:   - email: "k9ts@naver.com"
:     name: "k9ts"

** Docker

- Assume you are the project dir
#+BEGIN_SRC bash :exports both :results output
tree .
#+END_SRC

#+RESULTS:
#+begin_example
.
├── config
│   ├── config_example.yml
│   └── config.yml
├── crawl.cabal
├── Dockerfile
├── LICENSE
├── README.org
├── Setup.hs
├── src
│   ├── Config.hs
│   ├── Export.hs
│   ├── Main.hs
│   └── Reddit.hs
└── stack.yaml

2 directories, 12 files
#+end_example

- build
#+BEGIN_SRC bash :exports code
docker build -t reddit_crawl .
#+END_SRC

- run
#+BEGIN_SRC bash :exports code
docker run --rm reddit_crawl
#+END_SRC

Now add this run command to your scheduler

